
## Plan Result




<pre><code>Plan: 13 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.cmc-db-database-v14
  * azurerm_key_vault_secret.cmc-db-host-v14
  * azurerm_key_vault_secret.cmc-db-password-v14
  * azurerm_key_vault_secret.cmc-db-port-v14
  * azurerm_key_vault_secret.cmc-db-username-v14
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;cmc&#34;]
  * module.postgresql.azurerm_resource_group.rg[0]
  * module.postgresql.null_resource.set-user-permissions-additionaldbs[&#34;cmc&#34;]
  * module.postgresql.random_password.password
* Update
  * module.database.azurerm_resource_group.data-resourcegroup
  * module.database.azurerm_template_deployment.postgres-paas
  * module.database-v11.azurerm_resource_group.data-resourcegroup
  * module.database-v11.azurerm_template_deployment.postgres-paas


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.cmc-db-database-v14 will be created
  + resource "azurerm_key_vault_secret" "cmc-db-database-v14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.KeyVault/vaults/cmc-aat"
      + name                    = "cmc-db-database-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.cmc-db-host-v14 will be created
  + resource "azurerm_key_vault_secret" "cmc-db-host-v14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.KeyVault/vaults/cmc-aat"
      + name                    = "cmc-db-host-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.cmc-db-password-v14 will be created
  + resource "azurerm_key_vault_secret" "cmc-db-password-v14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.KeyVault/vaults/cmc-aat"
      + name                    = "cmc-db-password-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.cmc-db-port-v14 will be created
  + resource "azurerm_key_vault_secret" "cmc-db-port-v14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.KeyVault/vaults/cmc-aat"
      + name                    = "cmc-db-port-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.cmc-db-username-v14 will be created
  + resource "azurerm_key_vault_secret" "cmc-db-username-v14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.KeyVault/vaults/cmc-aat"
      + name                    = "cmc-db-username-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.database.data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "cmc-aat"
      + resource_group_name = "cmc-data-aat"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.database.azurerm_resource_group.data-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "data-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-data-aat"
        name     = "cmc-data-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/cmc-claim-store.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/cmc-claim-store.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.database.azurerm_template_deployment.postgres-paas will be updated in-place
  ~ resource "azurerm_template_deployment" "postgres-paas" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-data-aat/providers/Microsoft.Resources/deployments/cmc-aat"
        name                = "cmc-aat"
      ~ parameters          = {
          ~ "commonTags"                 = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLWNsYWltLXN0b3JlLmdpdCIsImFwcGxpY2F0aW9uIjoiY2l2aWwtbW9uZXktY2xhaW1zIiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY2hhbmdlVXJsIjoiIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNjbWMtdGVjaCIsImVudmlyb25tZW50Ijoic3RhZ2luZyIsIm1hbmFnZWRCeSI6Ik1vbmV5IENsYWltcyJ9" -> "eyJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9jbWMtY2xhaW0tc3RvcmUuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNjbWMtdGVjaCIsImVudmlyb25tZW50Ijoic3RhZ2luZyIsIm1hbmFnZWRCeSI6Ik1vbmV5IENsYWltcyJ9"
            # (17 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.database-v11.data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "cmc-db-v11-aat"
      + resource_group_name = "cmc-db-v11-data-aat"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.database-v11.azurerm_resource_group.data-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "data-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-db-v11-data-aat"
        name     = "cmc-db-v11-data-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/cmc-claim-store.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/cmc-claim-store.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.database-v11.azurerm_template_deployment.postgres-paas will be updated in-place
  ~ resource "azurerm_template_deployment" "postgres-paas" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-db-v11-data-aat/providers/Microsoft.Resources/deployments/cmc-db-v11-aat"
        name                = "cmc-db-v11-aat"
      ~ parameters          = {
          ~ "commonTags"                 = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLWNsYWltLXN0b3JlLmdpdCIsImFwcGxpY2F0aW9uIjoiY2l2aWwtbW9uZXktY2xhaW1zIiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY2hhbmdlVXJsIjoiIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNjbWMtdGVjaCIsImVudmlyb25tZW50Ijoic3RhZ2luZyIsIm1hbmFnZWRCeSI6Ik1vbmV5IENsYWltcyJ9" -> "eyJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9jbWMtY2xhaW0tc3RvcmUuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNjbWMtdGVjaCIsImVudmlyb25tZW50Ijoic3RhZ2luZyIsIm1hbmFnZWRCeSI6Ik1vbmV5IENsYWltcyJ9"
            # (17 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "cmc-claim-store-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "cmc-claim-store-data-aat"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"         = "civil-money-claims"
          + "builtFrom"           = "https://github.com/HMCTS/cmc-claim-store.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cmc-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Money Claims"
        }
      + version                       = "14"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "cmc-claim-store-data-aat"
      + server_name         = "cmc-claim-store-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "cmc-claim-store-data-aat"
      + server_name         = "cmc-claim-store-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases["cmc"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "cmc"
      + server_id = (known after apply)
    }

  # module.postgresql.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "cmc-claim-store-data-aat"
      + tags     = {
          + "application"         = "civil-money-claims"
          + "builtFrom"           = "https://github.com/HMCTS/cmc-claim-store.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#cmc-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Money Claims"
        }
    }

  # module.postgresql.null_resource.set-user-permissions-additionaldbs["cmc"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "name"           = "cmc-claim-store"
          + "script_hash"    = "f1b050abe4f2e8fc188c106259b04ba5034688164070e5ebb3e10137ad569f93"
        }
    }

  # module.postgresql.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 13 to add, 4 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2761,"Program":"tfcmt","SHA1":"","Vars":{}} -->